In [1]:
import pandas as pd

In [2]:
ca = pd.read_csv("customer_data_2014-15_attr.csv")

In [3]:
ca.head()

   CustomerId  Age CustomerSince Gender Region
0      500001   59          2012      F   East
1      500002   26          2013      M   East
2      500003   28          2013      F   West
3      500004   31          2015      M   West
4      500005   28          2013      F  South

In [4]:
ca['CustomerId']

0          500001
1          500002
2          500003
3          500004
4          500005
           ...
499995     999996
499996     999997
499997     999998
499998     999999
499999    1000000
Name: CustomerId, Length: 500000, dtype: int64

In [5]:
ca.shape

(500000, 5)

In [6]:
a = ca['CustomerId'].unique()

In [7]:
a.shape

(500000,)

In [8]:
cv = pd.read_csv("customer_data_2015_visited.csv")
ct = pd.read_csv("customer_data3_2015_transactions.csv")
ct['transactionDate'] = pd.to_datetime(ct['transactionDate'])

In [9]:
cv.head()

   CustomerID  Visits
0      500001      36
1      500002      32
2      500003      43
3      500004      33
4      500005      42

In [10]:
ct.head()

   transactionID  Spends  CustomerID transactionDate
0        1000001      16      843140      2015-01-01
1        1000002      31      697698      2015-01-01
2        1000003      27      746282      2015-01-01
3        1000004      28      645145      2015-01-01
4        1000005      22      766577      2015-01-01

In [11]:
ct['CustomerID'].nunique()

437323

In [12]:
cv.shape

(500000, 2)

In [13]:
cv['CustomerID'].unique()

array([ 500001,  500002,  500003, ...,  999998,  999999, 1000000])

In [14]:
cv.columns

Index(['CustomerID', 'Visits'], dtype='object')

In [15]:
ca = ca.rename(columns={'CustomerId':'CustomerID'})

In [16]:
ca

        CustomerID  Age CustomerSince Gender Region
0           500001   59          2012      F   East
1           500002   26          2013      M   East
2           500003   28          2013      F   West
3           500004   31          2015      M   West
4           500005   28          2013      F  South
...            ...  ...           ...    ...    ...
499995      999996   54          2012      M   West
499996      999997   56         <2011      F   East
499997      999998   59          2015      F   West
499998      999999   40          2015      M  South
499999     1000000   23          2012      M   East

[500000 rows x 5 columns]

In [17]:
temp_ex['Gender'][temp_ex['Gender'] == 'F'] = 1
temp_ex['Gender'][temp_ex['Gender'] == 'M'] = 0
temp_ex['Region'][temp_ex['Region'] == 'North'] = 0
temp_ex['Region'][temp_ex['Region'] == 'East'] = 1
temp_ex['Region'][temp_ex['Region'] == 'West'] = 2
temp_ex['Region'][temp_ex['Region'] == 'South'] = 3
temp_ex['CustomerSince'][temp_ex['CustomerSince'] == '<2011'] = 5
temp_ex['CustomerSince'][temp_ex['CustomerSince'] == '2015'] = 1
temp_ex['CustomerSince'][temp_ex['CustomerSince'] == '2014'] = 2
temp_ex['CustomerSince'][temp_ex['CustomerSince'] == '2013'] = 3
temp_ex['CustomerSince'][temp_ex['CustomerSince'] == '2012'] = 4

NameError: name 'temp_ex' is not defined

In [ ]:
final_table = pd.merge(ca, cv, on="CustomerID")

In [ ]:
final_table

In [ ]:
ct['CustomerID'].nunique()

In [ ]:
temp = ct['CustomerID'].value_counts()

In [ ]:
temp_df = pd.DataFrame(temp)
temp_df = temp_df.sort_index()
temp_df = temp_df.rename(columns={'CustomerID':'Transactions'})
temp_df['CustomerID'] = temp_df.index
temp_df = final_table.join(temp_df.set_index('CustomerID'), on='CustomerID')
temp_df['Transactions'] = temp_df['Transactions'].fillna(0)
temp_df

In [ ]:
ct[ct['CustomerID']==500002]

In [21]:
temp_ = ct.groupby(['CustomerID'])['transactionID'].max()
temp_ = pd.DataFrame(temp_)
temp_ = temp_.sort_index()
temp_ = temp_.rename(columns={'transactionDate':'lastTransactionDate','Spends':'output','transactionID':'lastTransactionID'})
temp_['CustomerID'] = temp_.index
temp_


# cond = ct['transactionID'].isin(temp_['lastTransactionID'])
# y = ct[ct['transactionID'] == temp['lastTransactionID'] ]
# y

# cond2 = ct['transactionID'].isin(temp_['lastTransactionID'])
# ct.drop(ct[cond].index, inplace = True)
# ct


# t = final_table.join(temp_['output'], on='CustomerID')
# t['output'] = t['output'].fillna(0)
# t

            lastTransactionID  CustomerID
CustomerID
500001                3754483      500001
500002                3593302      500002
500003                1541181      500003
500004                3791230      500004
500005                2448573      500005
...                       ...         ...
999996                3413951      999996
999997                3101516      999997
999998                3360769      999998
999999                3837681      999999
1000000               2272199     1000000

[437323 rows x 2 columns]

ValueError: Can only compare identically-labeled Series objects

In [28]:
ct[ct['CustomerID']==500005]

         transactionID  Spends  CustomerID transactionDate
1448572        2448573      72      500005      2015-09-01

In [139]:
ext = ct.groupby(['CustomerID'])['Spends'].mean()
temp_ex = pd.DataFrame(ext)
temp_ex = temp_ex.sort_index()
temp_ex = temp_ex.rename(columns={'Spends':'Avg_Spendings'})
temp_ex['CustomerID'] = temp_ex.index
temp_ex = final_table.join(temp_ex.set_index('CustomerID'), on='CustomerID')
temp_ex['Avg_Spendings'] = temp_ex['Avg_Spendings'].fillna(0)
temp_ex

        CustomerID  Age CustomerSince Gender Region  Visits  Avg_Spendings
0           500001   59          2012      F   East      36      37.250000
1           500002   26          2013      M   East      32      25.666667
2           500003   28          2013      F   West      43      38.000000
3           500004   31          2015      M   West      33      28.125000
4           500005   28          2013      F  South      42       0.000000
...            ...  ...           ...    ...    ...     ...            ...
499995      999996   54          2012      M   West      22      32.000000
499996      999997   56         <2011      F   East      30      34.400000
499997      999998   59          2015      F   West      23      36.200000
499998      999999   40          2015      M  South      29      23.727273
499999     1000000   23          2012      M   East      40      53.000000

[500000 rows x 7 columns]

In [62]:
def encode(column, dataframe):
    one_hot = pd.get_dummies(temp_ex[column])
    dataframe = dataframe.drop(column,axis = 1)
    dataframe = dataframe.join(one_hot)
    return dataframe

In [66]:
temp_ex = encode('Gender', temp_ex)
temp_ex = encode('Region', temp_ex)
temp_ex

,CustomerID,Age,CustomerSince,Visits,Avg_Spendings,F,M,East,North,South,West
0,500001,59,2012,36,36.000000,1,0,1,0,0,0
1,500002,26,2013,32,25.000000,0,1,1,0,0,0
2,500003,28,2013,43,37.500000,1,0,0,0,0,1
3,500004,31,2015,33,28.666667,0,1,0,0,0,1
4,500005,28,2013,42,72.000000,1,0,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...
499995,999996,54,2012,22,32.800000,0,1,0,0,0,1
499996,999997,56,<2011,30,35.166667,1,0,1,0,0,0
499997,999998,59,2015,23,35.500000,1,0,0,0,0,1
499998,999999,40,2015,29,23.833333,0,1,0,0,1,0
499999,1000000,23,2012,40,48.500000,0,1,1,0,0,0

/Users/vatsav/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/Users/vatsav/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/Users/vatsav/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
/Users/vatsav/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.
/Users/vatsav/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """
/Users/vatsav/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/Users/vatsav/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys
/Users/vatsav/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/Users/vatsav/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  if __name__ == '__main__':
/Users/vatsav/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  # Remove the CWD from sys.path while we load stuff.
/Users/vatsav/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  # This is added back by InteractiveShellApp.init_path()

In [141]:
temp_ex

        CustomerID  Age CustomerSince Gender Region  Visits  Avg_Spendings
0           500001   59             4      1      1      36      37.250000
1           500002   26             3      0      1      32      25.666667
2           500003   28             3      1      2      43      38.000000
3           500004   31             1      0      2      33      28.125000
4           500005   28             3      1      3      42       0.000000
...            ...  ...           ...    ...    ...     ...            ...
499995      999996   54             4      0      2      22      32.000000
499996      999997   56             5      1      1      30      34.400000
499997      999998   59             1      1      2      23      36.200000
499998      999999   40             1      0      3      29      23.727273
499999     1000000   23             4      0      1      40      53.000000

[500000 rows x 7 columns]

/Users/vatsav/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

,CustomerID,Age,CustomerSince,Gender,Region,Visits,Avg_Spendings,output
0,500001,59,4,1,1,36,37.250000,37.0
1,500002,26,3,0,1,32,25.666667,30.0
2,500003,28,3,1,2,43,38.000000,0.0
3,500004,31,1,0,2,33,28.125000,33.0
4,500005,28,3,1,3,42,0.000000,0.0
...,...,...,...,...,...,...,...,...
499995,999996,54,4,0,2,22,32.000000,29.0
499996,999997,56,5,1,1,30,34.400000,37.0
499997,999998,59,1,1,2,23,36.200000,47.0
499998,999999,40,1,0,3,29,23.727273,27.0
499999,1000000,23,4,0,1,40,53.000000,0.0

In [147]:
from sklearn.model_selection import train_test_split
X = t[]
X_train, X_test, y_train, y_test = train_test_split(, y, test_size=0.33, random_state=42)